# Module 7: Introduction to Data, Datasets, and Basic Python

*****************

### What is Data?

Data are individual units of information. In analytics, data are represented by variables. Data can include the names of everyone in a community, the height of each player on a basketball team, the life-expectency rate for several different countries, a description of symptoms from a patient over the course of a hospital stay, or the text from several articles about a specific topic. Data is endless, and as more avenues become available for collecting information, traditional data is expanding into BIG data. 

### Structure of a Dataset

In this course, we will be focusing exclusively on <b>structured</b> data -- that is, data that is already organized into a neat and pridictable structure. This includes storing data in columns and rows which makes it easy to understand and manipulate. 

![alt text](dataset.png "Structure of a Dataset")

### Variables, Values, Observations

* Data is typically stored in groups for easier manipulation and organization. 
* <b>VALUES</b> are individual bits of data. Values can include a number, a sentence, a symbol, an address, etc. Several values can be stored within a variable for easy access. 
    - Integer: a whole number (87)
    - Float: a decimal (6.87)
    - String value: alpha-numeric - "Hello"
* <b>VARIABLES</b> are containers for a specific series of values. A variable can hold one or several values. For example, a variable called <b>names</b> contains all the names of a group of students.

# Importing Data into Notebook with Python

***************************

#### Working with Structured Datasets

In this course, we will be working with structured datasets that are easy to explore and manipulate. Once you learn the basics of how to work with this style of data, you will be able to apply what you learn to numerous other datasets. It is possible to construct a dataset from scratch using Python (we will learn more about this later) -- but for now, we are going to work on importing already created datasets into your notebook.


#### What is a library?

Libraries are packages of pre-defined functions that are not included in basic python. You will need to manually import each library you want to access -- once imported, you can use all the libraries functions throughout the entire notebook. We will use multiple libraries throughout the duration of this course but we will start with the one library we will use in each class going forward - PANDAS. 

#### Intro to the Pandas Library 

Pandas stands for <b><i>Python Data Analysis Library</i></b>. This package makes working with and analyzing data with Python very easy and is one of the most preferred and used tools in data exploration/manipulation. Starting with Pandas will give you a fast and useful introduction to working with data and luckily, pandas is able to take data (like a CSV file) and transforms it into a Python object called a <b><i>DataFrame</i></b>. This is the same structure we consider a dataset.

#### Pandas Library

In [1]:
import pandas as pd

#### Importing a Dataset

In [133]:
df = pd.read_csv("Downloads\pokemon.csv")

#### Displaying the Dataset

In [5]:
df

,Num,Name,Type 1,Type 2,Total,HP,Attack,Defense,SpAtk,SpDef,Speed,Stage,Legendary
0,1,Bulbasaur,Grass,Poison,318,45,49,49,65,65,45,1,False
1,2,Ivysaur,Grass,Poison,405,60,62,63,80,80,60,2,False
2,3,Venusaur,Grass,Poison,525,80,82,83,100,100,80,3,False
3,4,Charmander,Fire,NaN,309,39,52,43,60,50,65,1,False
4,5,Charmeleon,Fire,NaN,405,58,64,58,80,65,80,2,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...
146,147,Dratini,Dragon,NaN,300,41,64,45,50,50,50,1,False
147,148,Dragonair,Dragon,NaN,420,61,84,65,70,70,70,2,False
148,149,Dragonite,Dragon,Flying,600,91,134,95,100,100,80,3,False
149,150,Mewtwo,Psychic,NaN,680,106,110,90,154,90,130,1,True
150,151,Mew,Psychic,NaN,600,100,100,100,100,100,100,1,False

In [6]:
df.head(15)

,Num,Name,Type 1,Type 2,Total,HP,Attack,Defense,SpAtk,SpDef,Speed,Stage,Legendary
0,1,Bulbasaur,Grass,Poison,318,45,49,49,65,65,45,1,False
1,2,Ivysaur,Grass,Poison,405,60,62,63,80,80,60,2,False
2,3,Venusaur,Grass,Poison,525,80,82,83,100,100,80,3,False
3,4,Charmander,Fire,NaN,309,39,52,43,60,50,65,1,False
4,5,Charmeleon,Fire,NaN,405,58,64,58,80,65,80,2,False
5,6,Charizard,Fire,Flying,534,78,84,78,109,85,100,3,False
6,7,Squirtle,Water,NaN,314,44,48,65,50,64,43,1,False
7,8,Wartortle,Water,NaN,405,59,63,80,65,80,58,2,False
8,9,Blastoise,Water,NaN,530,79,83,100,85,105,78,3,False
9,10,Caterpie,Bug,NaN,195,45,30,35,20,20,45,1,False
10,11,Metapod,Bug,NaN,205,50,20,55,25,25,30,2,False
11,12,Butterfree,Bug,Flying,395,60,45,50,90,80,70,3,False
12,13,Weedle,Bug,Poison,195,40,35,30,20,20,50,1,False
13,14,Kakuna,Bug,Poison,205,45,25,50,25,25,35,2,False
14,15,Beedrill,Bug,Poison,395,65,90,40,45,80,75,3,False

In [7]:
df.tail()

,Num,Name,Type 1,Type 2,Total,HP,Attack,Defense,SpAtk,SpDef,Speed,Stage,Legendary
146,147,Dratini,Dragon,NaN,300,41,64,45,50,50,50,1,False
147,148,Dragonair,Dragon,NaN,420,61,84,65,70,70,70,2,False
148,149,Dragonite,Dragon,Flying,600,91,134,95,100,100,80,3,False
149,150,Mewtwo,Psychic,NaN,680,106,110,90,154,90,130,1,True
150,151,Mew,Psychic,NaN,600,100,100,100,100,100,100,1,False

In [8]:
df.head(10)

,Num,Name,Type 1,Type 2,Total,HP,Attack,Defense,SpAtk,SpDef,Speed,Stage,Legendary
0,1,Bulbasaur,Grass,Poison,318,45,49,49,65,65,45,1,False
1,2,Ivysaur,Grass,Poison,405,60,62,63,80,80,60,2,False
2,3,Venusaur,Grass,Poison,525,80,82,83,100,100,80,3,False
3,4,Charmander,Fire,NaN,309,39,52,43,60,50,65,1,False
4,5,Charmeleon,Fire,NaN,405,58,64,58,80,65,80,2,False
5,6,Charizard,Fire,Flying,534,78,84,78,109,85,100,3,False
6,7,Squirtle,Water,NaN,314,44,48,65,50,64,43,1,False
7,8,Wartortle,Water,NaN,405,59,63,80,65,80,58,2,False
8,9,Blastoise,Water,NaN,530,79,83,100,85,105,78,3,False
9,10,Caterpie,Bug,NaN,195,45,30,35,20,20,45,1,False

#### Data Attributes

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 151 entries, 0 to 150
Data columns (total 13 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Num        151 non-null    int64
 1   Name       151 non-null    object
 2   Type 1     151 non-null    object
 3   Type 2     67 non-null     object
 4   Total      151 non-null    int64
 5   HP         151 non-null    int64
 6   Attack     151 non-null    int64
 7   Defense    151 non-null    int64
 8   SpAtk      151 non-null    int64
 9   SpDef      151 non-null    int64
 10  Speed      151 non-null    int64
 11  Stage      151 non-null    int64
 12  Legendary  151 non-null    bool
dtypes: bool(1), int64(9), object(3)
memory usage: 14.4+ KB

## { Exercise 1 }

Import the "dental.csv" file that is saved on canvas. 

* name the file "dt" when you import it
* preview the first 6 rows
* preview the last 4 rows
* use the code to find the information about the dataset. how many columns are there? how many rows?

In [27]:
dt = pd.read_csv("downloads\dental.csv", encoding="latin1")
dt

,First,Last,Age,Gender,Insurance,EmergencyContact,NewPatient,OutstandingBalance,Allergies
0,Jane,Jackson,35,F,Y,Y,N,48,N
1,Grant,Chaney,62,M,Y,Y,N,15,N
2,Shellie,Fowler,61,F,Y,Y,N,3,N
3,Hortensia,Moore,71,F,Y,Y,N,63,N
4,Gwenda,Oneal,41,F,Y,Y,N,0,N
5,Latricia,Sampson,21,F,Y,Y,N,0,N
6,Eun,Sims,52,M,Y,Y,N,0,N
7,Riva,Andrade,26,M,N,Y,N,0,N
8,Carolyn,Taylor,69,F,N,Y,N,0,N
9,Reid,Sims,37,M,Y,Y,N,341,N
10,Jamila,Downs,68,F,Y,N,N,294,N
11,Vannesa,Hays,55,F,Y,Y,N,13,N
12,Andre,Griffin,22,M,Y,N,N,99,N
13,Lynda,Wilkinson,60,F,Y,Y,N,151,N
14,Gricelda,Andrade,78,F,N,Y,N,128,N
15,Connie,Savage,34,F,N,Y,Y,0,N
16,Erma,Pruitt,36,F,N,Y,N,0,Y
17,Krysten,Richmond,40,F,Y,Y,N,0,N
18,Joel,Santos,39,M,Y,Y,N,0,N
19,Krystina,Benton,23,F,Y,Y,Y,0,N
20,Sharon,Landry,65,F,N,Y,Y,0,N
21,Marjorie,Dougherty,54,F,Y,Y,Y,0,N
22,Kenya,Compton,38,M,Y,Y,Y,210,N
23,Zenobia,Morgan,67,M,Y,N,Y,112,N
24,Stefany,Mahoney,46,F,Y,N,Y,42,N
25,Rosaura,Ellis,33,M,Y,N,Y,10,Y
26,Juliane,Hayden,24,F,N,N,N,275,N
27,Lesley,Moran,63,M,N,N,N,286,N
28,Ricki,Bailey,59,M,N,N,N,82,N
29,Bernadette,Chan,43,F,Y,N,N,0,N
30,Tessie,Russell,74,F,Y,N,N,152,Y
31,Alexa,Russell,25,M,Y,N,N,23,Y
32,Manuel,Mason,50,M,N,N,Y,66,N
33,Carolin,Hudson,19,F,Y,Y,Y,49,Y
34,Waneta,Cohen,51,F,Y,Y,N,44,N
35,Rana,Parks,27,M,Y,Y,Y,344,Y
36,Joline,Murillo,48,F,Y,Y,Y,41,N
37,Le,Mckenzie,47,M,Y,Y,N,78,Y
38,Shaquana,Yates,30,F,Y,Y,Y,121,N
39,Margarette,Tapia,70,F,Y,Y,N,235,N
40,Norah,Meyers,44,F,Y,Y,Y,89,N
41,Branden,Hays,53,M,Y,Y,N,108,N
42,Denita,Taylor,29,F,Y,Y,N,317,N
43,Mathilde,Gaines,32,F,Y,Y,N,0,N
44,Ettie,Wells,73,F,N,Y,N,0,N
45,Marjory,Thompson,45,F,N,Y,N,61,N
46,Erlinda,Hendricks,49,F,Y,Y,N,120,N
47,Amee,Carter,57,M,N,Y,N,0,Y
48,Loralee,Gates,66,F,Y,Y,Y,278,Y
49,Luana,Taylor,20,F,N,N,Y,302,N

In [24]:
dt.head(6)

,First,Last,Age,Gender,Insurance,EmergencyContact,NewPatient,OutstandingBalance,Allergies
0,Jane,Jackson,35,F,Y,Y,N,48,N
1,Grant,Chaney,62,M,Y,Y,N,15,N
2,Shellie,Fowler,61,F,Y,Y,N,3,N
3,Hortensia,Moore,71,F,Y,Y,N,63,N
4,Gwenda,Oneal,41,F,Y,Y,N,0,N
5,Latricia,Sampson,21,F,Y,Y,N,0,N

In [25]:
dt.tail(6)

,First,Last,Age,Gender,Insurance,EmergencyContact,NewPatient,OutstandingBalance,Allergies
44,Ettie,Wells,73,F,N,Y,N,0,N
45,Marjory,Thompson,45,F,N,Y,N,61,N
46,Erlinda,Hendricks,49,F,Y,Y,N,120,N
47,Amee,Carter,57,M,N,Y,N,0,Y
48,Loralee,Gates,66,F,Y,Y,Y,278,Y
49,Luana,Taylor,20,F,N,N,Y,302,N

In [28]:
dt.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 9 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   First               50 non-null     object
 1   Last                50 non-null     object
 2   Age                 50 non-null     int64
 3   Gender              50 non-null     object
 4   Insurance           50 non-null     object
 5   EmergencyContact    50 non-null     object
 6   NewPatient          50 non-null     object
 7   OutstandingBalance  50 non-null     int64
 8   Allergies           50 non-null     object
dtypes: int64(2), object(7)
memory usage: 3.6+ KB

#### Highlighting and Selecting Columns

In [29]:
df["Name"]

0       Bulbasaur
1         Ivysaur
2        Venusaur
3      Charmander
4      Charmeleon
          ...
146       Dratini
147     Dragonair
148     Dragonite
149        Mewtwo
150           Mew
Name: Name, Length: 151, dtype: object

In [30]:
df["Name"][0]

'Bulbasaur'

In [31]:
df[["Name"]]

           Name
0     Bulbasaur
1       Ivysaur
2      Venusaur
3    Charmander
4    Charmeleon
..          ...
146     Dratini
147   Dragonair
148   Dragonite
149      Mewtwo
150         Mew

[151 rows x 1 columns]

In [32]:
df[["Name", "Type 1", "Stage"]]

           Name   Type 1  Stage
0     Bulbasaur    Grass      1
1       Ivysaur    Grass      2
2      Venusaur    Grass      3
3    Charmander     Fire      1
4    Charmeleon     Fire      2
..          ...      ...    ...
146     Dratini   Dragon      1
147   Dragonair   Dragon      2
148   Dragonite   Dragon      3
149      Mewtwo  Psychic      1
150         Mew  Psychic      1

[151 rows x 3 columns]

In [33]:
## creating a new dataset from an existing
# pick and choose the columns you want to include

df2 = df[["Name", "Type 1", "Type 2", "Stage"]]

# preview the new dataset

df2.head()

         Name Type 1  Type 2  Stage
0   Bulbasaur  Grass  Poison      1
1     Ivysaur  Grass  Poison      2
2    Venusaur  Grass  Poison      3
3  Charmander   Fire     NaN      1
4  Charmeleon   Fire     NaN      2

## { Exercise 2 }

Using the "dental.csv" file that you imported in the earlier exercise:

* select the column that shows the persons first name 
* select the column that shows the age of the dental patients
* select the first row of the column that shows if the patient has insurance
* return four columns (you pick) using one line of code
* create a new dataset called "dt2" that only includes first name, age, and gender

In [34]:
dt[["First"]]

           First
0         Jane Â
1        Grant Â
2      Shellie Â
3    Hortensia Â
4       Gwenda Â
5     Latricia Â
6          Eun Â
7         Riva Â
8      Carolyn Â
9         Reid Â
10      Jamila Â
11     Vannesa Â
12       Andre Â
13       Lynda Â
14    Gricelda Â
15      Connie Â
16        Erma Â
17     Krysten Â
18        Joel Â
19    Krystina Â
20      Sharon Â
21    Marjorie Â
22       Kenya Â
23     Zenobia Â
24     Stefany Â
25     Rosaura Â
26     Juliane Â
27      Lesley Â
28       Ricki Â
29  Bernadette Â
30      Tessie Â
31       Alexa Â
32      Manuel Â
33     Carolin Â
34      Waneta Â
35        Rana Â
36      Joline Â
37          Le Â
38    Shaquana Â
39  Margarette Â
40       Norah Â
41     Branden Â
42      Denita Â
43    Mathilde Â
44       Ettie Â
45     Marjory Â
46     Erlinda Â
47        Amee Â
48     Loralee Â
49         Luana

In [35]:
dt[["Age"]]

    Age
0    35
1    62
2    61
3    71
4    41
5    21
6    52
7    26
8    69
9    37
10   68
11   55
12   22
13   60
14   78
15   34
16   36
17   40
18   39
19   23
20   65
21   54
22   38
23   67
24   46
25   33
26   24
27   63
28   59
29   43
30   74
31   25
32   50
33   19
34   51
35   27
36   48
37   47
38   30
39   70
40   44
41   53
42   29
43   32
44   73
45   45
46   49
47   57
48   66
49   20

In [36]:
dt["Insurance"][0]

'Y'

In [37]:
dt[["First", "Last", "Age", "Gender"]]

           First       Last  Age Gender
0         Jane Â     Jackson   35      F
1        Grant Â      Chaney   62      M
2      Shellie Â      Fowler   61      F
3    Hortensia Â       Moore   71      F
4       Gwenda Â       Oneal   41      F
5     Latricia Â     Sampson   21      F
6          Eun Â        Sims   52      M
7         Riva Â     Andrade   26      M
8      Carolyn Â      Taylor   69      F
9         Reid Â        Sims   37      M
10      Jamila Â       Downs   68      F
11     Vannesa Â        Hays   55      F
12       Andre Â     Griffin   22      M
13       Lynda Â   Wilkinson   60      F
14    Gricelda Â     Andrade   78      F
15      Connie Â      Savage   34      F
16        Erma Â      Pruitt   36      F
17     Krysten Â    Richmond   40      F
18        Joel Â      Santos   39      M
19    Krystina Â      Benton   23      F
20      Sharon Â      Landry   65      F
21    Marjorie Â   Dougherty   54      F
22       Kenya Â     Compton   38      M
23     Zenobia Â      Morgan   67      M
24     Stefany Â     Mahoney   46      F
25     Rosaura Â       Ellis   33      M
26     Juliane Â      Hayden   24      F
27      Lesley Â       Moran   63      M
28       Ricki Â      Bailey   59      M
29  Bernadette Â        Chan   43      F
30      Tessie Â     Russell   74      F
31       Alexa Â     Russell   25      M
32      Manuel Â       Mason   50      M
33     Carolin Â      Hudson   19      F
34      Waneta Â       Cohen   51      F
35        Rana Â       Parks   27      M
36      Joline Â     Murillo   48      F
37          Le Â    Mckenzie   47      M
38    Shaquana Â       Yates   30      F
39  Margarette Â       Tapia   70      F
40       Norah Â      Meyers   44      F
41     Branden Â        Hays   53      M
42      Denita Â      Taylor   29      F
43    Mathilde Â      Gaines   32      F
44       Ettie Â       Wells   73      F
45     Marjory Â    Thompson   45      F
46     Erlinda Â   Hendricks   49      F
47        Amee Â      Carter   57      M
48     Loralee Â       Gates   66      F
49         Luana     Taylor   20      F

In [39]:
dt2 = dt[["First", "Age", "Gender"]]
dt2

           First  Age Gender
0         Jane Â    35      F
1        Grant Â    62      M
2      Shellie Â    61      F
3    Hortensia Â    71      F
4       Gwenda Â    41      F
5     Latricia Â    21      F
6          Eun Â    52      M
7         Riva Â    26      M
8      Carolyn Â    69      F
9         Reid Â    37      M
10      Jamila Â    68      F
11     Vannesa Â    55      F
12       Andre Â    22      M
13       Lynda Â    60      F
14    Gricelda Â    78      F
15      Connie Â    34      F
16        Erma Â    36      F
17     Krysten Â    40      F
18        Joel Â    39      M
19    Krystina Â    23      F
20      Sharon Â    65      F
21    Marjorie Â    54      F
22       Kenya Â    38      M
23     Zenobia Â    67      M
24     Stefany Â    46      F
25     Rosaura Â    33      M
26     Juliane Â    24      F
27      Lesley Â    63      M
28       Ricki Â    59      M
29  Bernadette Â    43      F
30      Tessie Â    74      F
31       Alexa Â    25      M
32      Manuel Â    50      M
33     Carolin Â    19      F
34      Waneta Â    51      F
35        Rana Â    27      M
36      Joline Â    48      F
37          Le Â    47      M
38    Shaquana Â    30      F
39  Margarette Â    70      F
40       Norah Â    44      F
41     Branden Â    53      M
42      Denita Â    29      F
43    Mathilde Â    32      F
44       Ettie Â    73      F
45     Marjory Â    45      F
46     Erlinda Â    49      F
47        Amee Â    57      M
48     Loralee Â    66      F
49         Luana   20      F

### Indexing and Slicing a Dataset: iloc method

Indexing in python is zero-based (numbering starts with 0). Index recalls the item that is at a specific position. When you are working with datasets, the indexing references the rows and columns of the entire dataset. 

* The iloc method selects rows and columns based on the index value.

In [40]:
df.head()

,Num,Name,Type 1,Type 2,Total,HP,Attack,Defense,SpAtk,SpDef,Speed,Stage,Legendary
0,1,Bulbasaur,Grass,Poison,318,45,49,49,65,65,45,1,False
1,2,Ivysaur,Grass,Poison,405,60,62,63,80,80,60,2,False
2,3,Venusaur,Grass,Poison,525,80,82,83,100,100,80,3,False
3,4,Charmander,Fire,NaN,309,39,52,43,60,50,65,1,False
4,5,Charmeleon,Fire,NaN,405,58,64,58,80,65,80,2,False

#### Selecting Rows with iloc

In [41]:
# selecting a specific row

df.iloc[0]

Num                  1
Name         Bulbasaur
Type 1           Grass
Type 2          Poison
Total              318
HP                  45
Attack              49
Defense             49
SpAtk               65
SpDef               65
Speed               45
Stage                1
Legendary        False
Name: 0, dtype: object

In [42]:
# selecting a specific row

df.iloc[4]

Num                   5
Name         Charmeleon
Type 1             Fire
Type 2              NaN
Total               405
HP                   58
Attack               64
Defense              58
SpAtk                80
SpDef                65
Speed                80
Stage                 2
Legendary         False
Name: 4, dtype: object

In [43]:
# slicing a dataset
# rows 0 through 5

df.iloc[0:6]

,Num,Name,Type 1,Type 2,Total,HP,Attack,Defense,SpAtk,SpDef,Speed,Stage,Legendary
0,1,Bulbasaur,Grass,Poison,318,45,49,49,65,65,45,1,False
1,2,Ivysaur,Grass,Poison,405,60,62,63,80,80,60,2,False
2,3,Venusaur,Grass,Poison,525,80,82,83,100,100,80,3,False
3,4,Charmander,Fire,NaN,309,39,52,43,60,50,65,1,False
4,5,Charmeleon,Fire,NaN,405,58,64,58,80,65,80,2,False
5,6,Charizard,Fire,Flying,534,78,84,78,109,85,100,3,False

In [44]:
# slicing a dataset
# skipping rows with step option

df.iloc[0:11:2]

,Num,Name,Type 1,Type 2,Total,HP,Attack,Defense,SpAtk,SpDef,Speed,Stage,Legendary
0,1,Bulbasaur,Grass,Poison,318,45,49,49,65,65,45,1,False
2,3,Venusaur,Grass,Poison,525,80,82,83,100,100,80,3,False
4,5,Charmeleon,Fire,NaN,405,58,64,58,80,65,80,2,False
6,7,Squirtle,Water,NaN,314,44,48,65,50,64,43,1,False
8,9,Blastoise,Water,NaN,530,79,83,100,85,105,78,3,False
10,11,Metapod,Bug,NaN,205,50,20,55,25,25,30,2,False

In [45]:
# slicing a dataset
# skipping rows with step option

df.iloc[0:11:3]

,Num,Name,Type 1,Type 2,Total,HP,Attack,Defense,SpAtk,SpDef,Speed,Stage,Legendary
0,1,Bulbasaur,Grass,Poison,318,45,49,49,65,65,45,1,False
3,4,Charmander,Fire,NaN,309,39,52,43,60,50,65,1,False
6,7,Squirtle,Water,NaN,314,44,48,65,50,64,43,1,False
9,10,Caterpie,Bug,NaN,195,45,30,35,20,20,45,1,False

In [46]:
# selecting non-consecutive rows

df.iloc[[0, 17, 38]]

,Num,Name,Type 1,Type 2,Total,HP,Attack,Defense,SpAtk,SpDef,Speed,Stage,Legendary
0,1,Bulbasaur,Grass,Poison,318,45,49,49,65,65,45,1,False
17,18,Pidgeot,Normal,Flying,479,83,80,75,70,70,101,3,False
38,39,Jigglypuff,Normal,Fairy,270,115,45,20,45,25,20,1,False

#### Selecting Columns with iloc

In [47]:
# selecting rows and columns by index 
# df.iloc[row index, column index]

# what information can be found at row 0 column 1?

df.iloc[0,1]

'Bulbasaur'

In [48]:
# what information can be found at row 10 column 3?

df.iloc[10,3]

nan

In [49]:
# selecting multiple columns 

# selecting row 10, columns 0 through 3

df.iloc[10, 0:4]

Num            11
Name      Metapod
Type 1        Bug
Type 2        NaN
Name: 10, dtype: object

In [50]:
# selecting non-consecutive columns with iloc

df.iloc[10, [0, 2, 4]]

Num        11
Type 1    Bug
Total     205
Name: 10, dtype: object

In [51]:
# selecting non-consecutive columns with iloc
# return output as dataframe style 

df.iloc[[10], [0, 2, 4]]

    Num Type 1  Total
10   11    Bug    205

In [52]:
# selecting non-consecutive rows and columns

df.iloc[[0, 6, 12], [1, 3, 5]]

         Name  Type 2  HP
0   Bulbasaur  Poison  45
6    Squirtle     NaN  44
12     Weedle  Poison  40

In [53]:
# selecting all rows for specific columns
# use " : " to represent all rows 

df.iloc[:, [0, 3, 6]]

     Num  Type 2  Attack
0      1  Poison      49
1      2  Poison      62
2      3  Poison      82
3      4     NaN      52
4      5     NaN      64
..   ...     ...     ...
146  147     NaN      64
147  148     NaN      84
148  149  Flying     134
149  150     NaN     110
150  151     NaN     100

[151 rows x 3 columns]

In [54]:
## selecting all columns for specific rows

df.iloc[[3, 5, 10], :]

,Num,Name,Type 1,Type 2,Total,HP,Attack,Defense,SpAtk,SpDef,Speed,Stage,Legendary
3,4,Charmander,Fire,NaN,309,39,52,43,60,50,65,1,False
5,6,Charizard,Fire,Flying,534,78,84,78,109,85,100,3,False
10,11,Metapod,Bug,NaN,205,50,20,55,25,25,30,2,False

## { Exercise 3 }

Using the "dental.csv" file that you imported in the earlier exercise:

* view the first 10 rows of data in the "dt" dataset
* select one row of data in the "dt" dataset, select the row at index position 16
* select the rows in the "dt" dataset from index position 0 to 10 (make sure your output includes the row at index 10)
* select the rows 0, 10, 20, 30, and 40 from the "dt" dataset. What is the name of the individual in row 30?
* select the row at index position 33 for only the column in index position 2. What information is given?
* select the rows between index positions 0 through 10 - for the columns in positions 0, 4, and 5.

In [56]:
dt.head(10)

,First,Last,Age,Gender,Insurance,EmergencyContact,NewPatient,OutstandingBalance,Allergies
0,Jane,Jackson,35,F,Y,Y,N,48,N
1,Grant,Chaney,62,M,Y,Y,N,15,N
2,Shellie,Fowler,61,F,Y,Y,N,3,N
3,Hortensia,Moore,71,F,Y,Y,N,63,N
4,Gwenda,Oneal,41,F,Y,Y,N,0,N
5,Latricia,Sampson,21,F,Y,Y,N,0,N
6,Eun,Sims,52,M,Y,Y,N,0,N
7,Riva,Andrade,26,M,N,Y,N,0,N
8,Carolyn,Taylor,69,F,N,Y,N,0,N
9,Reid,Sims,37,M,Y,Y,N,341,N

In [63]:
dt.iloc[16]

First                 Erma Â
Last                  Pruitt
Age                       36
Gender                     F
Insurance                  N
EmergencyContact           Y
NewPatient                 N
OutstandingBalance         0
Allergies                  Y
Name: 16, dtype: object

In [64]:
dt.iloc[0:11]

,First,Last,Age,Gender,Insurance,EmergencyContact,NewPatient,OutstandingBalance,Allergies
0,Jane,Jackson,35,F,Y,Y,N,48,N
1,Grant,Chaney,62,M,Y,Y,N,15,N
2,Shellie,Fowler,61,F,Y,Y,N,3,N
3,Hortensia,Moore,71,F,Y,Y,N,63,N
4,Gwenda,Oneal,41,F,Y,Y,N,0,N
5,Latricia,Sampson,21,F,Y,Y,N,0,N
6,Eun,Sims,52,M,Y,Y,N,0,N
7,Riva,Andrade,26,M,N,Y,N,0,N
8,Carolyn,Taylor,69,F,N,Y,N,0,N
9,Reid,Sims,37,M,Y,Y,N,341,N
10,Jamila,Downs,68,F,Y,N,N,294,N

In [65]:
dt.iloc[[0, 10, 20, 30, 40]]

,First,Last,Age,Gender,Insurance,EmergencyContact,NewPatient,OutstandingBalance,Allergies
0,Jane,Jackson,35,F,Y,Y,N,48,N
10,Jamila,Downs,68,F,Y,N,N,294,N
20,Sharon,Landry,65,F,N,Y,Y,0,N
30,Tessie,Russell,74,F,Y,N,N,152,Y
40,Norah,Meyers,44,F,Y,Y,Y,89,N

In [66]:
dt.iloc[33,2]

19

In [67]:
dt.iloc [ 0 :11, [0, 4, 5]]

          First Insurance EmergencyContact
0        Jane Â          Y                Y
1       Grant Â          Y                Y
2     Shellie Â          Y                Y
3   Hortensia Â          Y                Y
4      Gwenda Â          Y                Y
5    Latricia Â          Y                Y
6         Eun Â          Y                Y
7        Riva Â          N                Y
8     Carolyn Â          N                Y
9        Reid Â          Y                Y
10     Jamila Â          Y                N

### Indexing and Slicing a Dataset: loc method

When you use the loc method (instead of iloc), instead of referencing the index numeric-value -- you reference the label of the row/column. This method has several limitations, and the data will have to be in a specific format to use this method. 

* The loc method selects rows and columns based on a row or column label.

In [69]:
# changing the index of a dataset

df = pd.read_csv("downloads\pokemon.csv", index_col = "Name")

# import the dataset as you saw previously
# include the option  >> index_col = "column name"

df.head()

,Num,Type 1,Type 2,Total,HP,Attack,Defense,SpAtk,SpDef,Speed,Stage,Legendary
Name,,,,,,,,,,,,
Bulbasaur,1,Grass,Poison,318,45,49,49,65,65,45,1,False
Ivysaur,2,Grass,Poison,405,60,62,63,80,80,60,2,False
Venusaur,3,Grass,Poison,525,80,82,83,100,100,80,3,False
Charmander,4,Fire,NaN,309,39,52,43,60,50,65,1,False
Charmeleon,5,Fire,NaN,405,58,64,58,80,65,80,2,False

In [71]:
# instead of calling a row by index number, you will use index label

df.loc[["Pikachu"]]

,Num,Type 1,Type 2,Total,HP,Attack,Defense,SpAtk,SpDef,Speed,Stage,Legendary
Name,,,,,,,,,,,,
Pikachu,25,Electric,NaN,320,35,55,40,50,50,90,1,False

In [72]:
# selecting multiple rows with loc

df.loc[["Metapod", "Weedle", "Charmander"]]

,Num,Type 1,Type 2,Total,HP,Attack,Defense,SpAtk,SpDef,Speed,Stage,Legendary
Name,,,,,,,,,,,,
Metapod,11,Bug,NaN,205,50,20,55,25,25,30,2,False
Weedle,13,Bug,Poison,195,40,35,30,20,20,50,1,False
Charmander,4,Fire,NaN,309,39,52,43,60,50,65,1,False

In [73]:
# selecting rows and columns

df.loc["Pikachu", "Type 1"]

'Electric'

In [74]:
# selecting multiple rows and multiple columns 

df.loc[["Metapod", "Weedle", "Charmander"],["Type 1","HP","Stage"]]

           Type 1  HP  Stage
Name
Metapod       Bug  50      2
Weedle        Bug  40      1
Charmander   Fire  39      1

In [75]:
# selecting all rows or all columns

## all rows

df.loc[:, ["Type 1", "Stage"]]

             Type 1  Stage
Name
Bulbasaur     Grass      1
Ivysaur       Grass      2
Venusaur      Grass      3
Charmander     Fire      1
Charmeleon     Fire      2
...             ...    ...
Dratini      Dragon      1
Dragonair    Dragon      2
Dragonite    Dragon      3
Mewtwo      Psychic      1
Mew         Psychic      1

[151 rows x 2 columns]

In [76]:
# selecting all rows or all columns

## all columns

df.loc[["Pikachu", "Weedle"], :]

,Num,Type 1,Type 2,Total,HP,Attack,Defense,SpAtk,SpDef,Speed,Stage,Legendary
Name,,,,,,,,,,,,
Pikachu,25,Electric,NaN,320,35,55,40,50,50,90,1,False
Weedle,13,Bug,Poison,195,40,35,30,20,20,50,1,False

In [77]:
# slicing using loc

df.loc["Ivysaur":"Weedle", "Stage"]

Name
Ivysaur       2
Venusaur      3
Charmander    1
Charmeleon    2
Charizard     3
Squirtle      1
Wartortle     2
Blastoise     3
Caterpie      1
Metapod       2
Butterfree    3
Weedle        1
Name: Stage, dtype: int64

In [78]:
# slicing using loc

df.loc["Ivysaur", "Type 1":"Attack"]

Type 1     Grass
Type 2    Poison
Total        405
HP            60
Attack        62
Name: Ivysaur, dtype: object

## { Exercise 4 }

Using the "dental.csv" file that you imported in the earlier exercise:

* Import the "dental.csv" dataset again. This time, change the index to the column "Last". Again, nickname the dataset "dt". Preview the first five rows of the dataset. Does the index look like you expected?
* Select the row with the label "Hudson". What information is available for this person?
* Select the rows with the labels "Bailey", "Hays", and "Taylor" -- how many individuals in the dataset have one of these last names?
* Select the rows with the label "Compton" for the columns "Age", "Gender", "Insurance", and "New Patient". Is this person a new or existing patient?
* It's time to send everyone their outstanding bills! Select all the rows for the columns "First" and "OutstandingBalance".

In [82]:
dt = pd.read_csv("downloads\dental.csv", encoding="latin1", index_col = "Last")
dt

,First,Age,Gender,Insurance,EmergencyContact,NewPatient,OutstandingBalance,Allergies
Last,,,,,,,,
Jackson,Jane,35,F,Y,Y,N,48,N
Chaney,Grant,62,M,Y,Y,N,15,N
Fowler,Shellie,61,F,Y,Y,N,3,N
Moore,Hortensia,71,F,Y,Y,N,63,N
Oneal,Gwenda,41,F,Y,Y,N,0,N
Sampson,Latricia,21,F,Y,Y,N,0,N
Sims,Eun,52,M,Y,Y,N,0,N
Andrade,Riva,26,M,N,Y,N,0,N
Taylor,Carolyn,69,F,N,Y,N,0,N
Sims,Reid,37,M,Y,Y,N,341,N
Downs,Jamila,68,F,Y,N,N,294,N
Hays,Vannesa,55,F,Y,Y,N,13,N
Griffin,Andre,22,M,Y,N,N,99,N
Wilkinson,Lynda,60,F,Y,Y,N,151,N
Andrade,Gricelda,78,F,N,Y,N,128,N
Savage,Connie,34,F,N,Y,Y,0,N
Pruitt,Erma,36,F,N,Y,N,0,Y
Richmond,Krysten,40,F,Y,Y,N,0,N
Santos,Joel,39,M,Y,Y,N,0,N
Benton,Krystina,23,F,Y,Y,Y,0,N
Landry,Sharon,65,F,N,Y,Y,0,N
Dougherty,Marjorie,54,F,Y,Y,Y,0,N
Compton,Kenya,38,M,Y,Y,Y,210,N
Morgan,Zenobia,67,M,Y,N,Y,112,N
Mahoney,Stefany,46,F,Y,N,Y,42,N
Ellis,Rosaura,33,M,Y,N,Y,10,Y
Hayden,Juliane,24,F,N,N,N,275,N
Moran,Lesley,63,M,N,N,N,286,N
Bailey,Ricki,59,M,N,N,N,82,N
Chan,Bernadette,43,F,Y,N,N,0,N
Russell,Tessie,74,F,Y,N,N,152,Y
Russell,Alexa,25,M,Y,N,N,23,Y
Mason,Manuel,50,M,N,N,Y,66,N
Hudson,Carolin,19,F,Y,Y,Y,49,Y
Cohen,Waneta,51,F,Y,Y,N,44,N
Parks,Rana,27,M,Y,Y,Y,344,Y
Murillo,Joline,48,F,Y,Y,Y,41,N
Mckenzie,Le,47,M,Y,Y,N,78,Y
Yates,Shaquana,30,F,Y,Y,Y,121,N
Tapia,Margarette,70,F,Y,Y,N,235,N
Meyers,Norah,44,F,Y,Y,Y,89,N
Hays,Branden,53,M,Y,Y,N,108,N
Taylor,Denita,29,F,Y,Y,N,317,N
Gaines,Mathilde,32,F,Y,Y,N,0,N
Wells,Ettie,73,F,N,Y,N,0,N
Thompson,Marjory,45,F,N,Y,N,61,N
Hendricks,Erlinda,49,F,Y,Y,N,120,N
Carter,Amee,57,M,N,Y,N,0,Y
Gates,Loralee,66,F,Y,Y,Y,278,Y
Taylor,Luana,20,F,N,N,Y,302,N

In [83]:
dt.loc["Hudson"]

First                 Carolin Â
Age                          19
Gender                        F
Insurance                     Y
EmergencyContact              Y
NewPatient                    Y
OutstandingBalance           49
Allergies                     Y
Name: Hudson, dtype: object

In [85]:
dt.loc[["Bailey", "Hays", "Taylor"]]

,First,Age,Gender,Insurance,EmergencyContact,NewPatient,OutstandingBalance,Allergies
Last,,,,,,,,
Bailey,Ricki,59,M,N,N,N,82,N
Hays,Vannesa,55,F,Y,Y,N,13,N
Hays,Branden,53,M,Y,Y,N,108,N
Taylor,Carolyn,69,F,N,Y,N,0,N
Taylor,Denita,29,F,Y,Y,N,317,N
Taylor,Luana,20,F,N,N,Y,302,N

In [87]:
dt.loc["Compton", ["Age", "Gender", "Insurance", "NewPatient"]]

Age           38
Gender         M
Insurance      Y
NewPatient     Y
Name: Compton, dtype: object

In [88]:
dt.loc[:, ["First", "OutstandingBalance"]]

                  First  OutstandingBalance
Last
Jackson          Jane Â                   48
Chaney          Grant Â                   15
Fowler        Shellie Â                    3
Moore       Hortensia Â                   63
Oneal          Gwenda Â                    0
Sampson      Latricia Â                    0
Sims              Eun Â                    0
Andrade          Riva Â                    0
Taylor        Carolyn Â                    0
Sims             Reid Â                  341
Downs          Jamila Â                  294
Hays          Vannesa Â                   13
Griffin         Andre Â                   99
Wilkinson       Lynda Â                  151
Andrade      Gricelda Â                  128
Savage         Connie Â                    0
Pruitt           Erma Â                    0
Richmond      Krysten Â                    0
Santos           Joel Â                    0
Benton       Krystina Â                    0
Landry         Sharon Â                    0
Dougherty    Marjorie Â                    0
Compton         Kenya Â                  210
Morgan        Zenobia Â                  112
Mahoney       Stefany Â                   42
Ellis         Rosaura Â                   10
Hayden        Juliane Â                  275
Moran          Lesley Â                  286
Bailey          Ricki Â                   82
Chan       Bernadette Â                    0
Russell        Tessie Â                  152
Russell         Alexa Â                   23
Mason          Manuel Â                   66
Hudson        Carolin Â                   49
Cohen          Waneta Â                   44
Parks            Rana Â                  344
Murillo        Joline Â                   41
Mckenzie           Le Â                   78
Yates        Shaquana Â                  121
Tapia      Margarette Â                  235
Meyers          Norah Â                   89
Hays          Branden Â                  108
Taylor         Denita Â                  317
Gaines       Mathilde Â                    0
Wells           Ettie Â                    0
Thompson      Marjory Â                   61
Hendricks     Erlinda Â                  120
Carter           Amee Â                    0
Gates         Loralee Â                  278
Taylor            Luana                 302

#### Exporting Data to .csv file

In [111]:
dt.to_csv("downloads\Walterpython.csv")

## { Module 6 Practice }

#### The Basics

* Create a variable that has an integer value and another variable that has a float value.
* Print the sum of the two variables you just created.
* Write the code to find the type of data each variable contains.
* Create a list with all the days of the week. Name it "days". Print the list.

In [92]:
var1 = 5
var2 = 5.556

print(var1 + var2)

10.556000000000001

In [93]:
type(var1)

int

In [94]:
type(var2)

float

In [95]:
days = {"monday", "tuesday", "wednesday", "thursday", "friday", "saturday", "sunday"}
print(days)

{'friday', 'wednesday', 'sunday', 'saturday', 'thursday', 'monday', 'tuesday'}

#### Importing and Inspecting Data

* Import the pandas library and nickname it "pd"
* Import the "pokemon.csv" file, nickname the dataset "pk"
* Inspect the first five rows of "pk". What is the name of the first Pokemon listed?
* Inspect the last 5 rows of "pk". How many rows are there total in the dataset?
* Complete the code below to output the summary information about the dataset. How many columns are there total in "pk"? In which column(s) do we have miss/NaN values?

In [96]:
import pandas as pd

In [97]:
pk = pd.read_csv("Downloads\pokemon.csv")

In [98]:
pk.head()

,Num,Name,Type 1,Type 2,Total,HP,Attack,Defense,SpAtk,SpDef,Speed,Stage,Legendary
0,1,Bulbasaur,Grass,Poison,318,45,49,49,65,65,45,1,False
1,2,Ivysaur,Grass,Poison,405,60,62,63,80,80,60,2,False
2,3,Venusaur,Grass,Poison,525,80,82,83,100,100,80,3,False
3,4,Charmander,Fire,NaN,309,39,52,43,60,50,65,1,False
4,5,Charmeleon,Fire,NaN,405,58,64,58,80,65,80,2,False

In [99]:
pk.tail()

,Num,Name,Type 1,Type 2,Total,HP,Attack,Defense,SpAtk,SpDef,Speed,Stage,Legendary
146,147,Dratini,Dragon,NaN,300,41,64,45,50,50,50,1,False
147,148,Dragonair,Dragon,NaN,420,61,84,65,70,70,70,2,False
148,149,Dragonite,Dragon,Flying,600,91,134,95,100,100,80,3,False
149,150,Mewtwo,Psychic,NaN,680,106,110,90,154,90,130,1,True
150,151,Mew,Psychic,NaN,600,100,100,100,100,100,100,1,False

In [100]:
pk.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 151 entries, 0 to 150
Data columns (total 13 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Num        151 non-null    int64
 1   Name       151 non-null    object
 2   Type 1     151 non-null    object
 3   Type 2     67 non-null     object
 4   Total      151 non-null    int64
 5   HP         151 non-null    int64
 6   Attack     151 non-null    int64
 7   Defense    151 non-null    int64
 8   SpAtk      151 non-null    int64
 9   SpDef      151 non-null    int64
 10  Speed      151 non-null    int64
 11  Stage      151 non-null    int64
 12  Legendary  151 non-null    bool
dtypes: bool(1), int64(9), object(3)
memory usage: 14.4+ KB

#### Subsets and Indexing 

* It looks like "pk" has a lot more information than we need right now. Let's simplfy by only looking at a subset of the original dataset. Write the code to show only the following columns: "Name", "Type 1", "Attack", "Defense", and "Stage".
* Using the iloc function, select the rows from index position 0 to 10, for columns "Name" and "Type 1".
* Using the iloc function, select the rows at index position 0, 10, 20, 30, 45, and 50, for all columns.
* Re-import the pokemon dataset and change the index to be the "Name" column. Again, nickname this dataset "pk". Preview the first five rows of "pk" to check if the new index is as expected.
* Using the loc function, select the rows with labels: "Metapod", "Weedle", and "Mew" for all columns. Which pokemon has the highest Attack value?
* Using the loc function, select the rows with the labels: "Charmander", "Charmeleon", and "Charizard", for the columns with the labels: "Type 1", "Attack", "Defense", and "Stage". Which pokemon has the lowest defense value?

In [101]:
pk[["Name", "Type 1", "Attack", "Defense", "Stage"]]

           Name   Type 1  Attack  Defense  Stage
0     Bulbasaur    Grass      49       49      1
1       Ivysaur    Grass      62       63      2
2      Venusaur    Grass      82       83      3
3    Charmander     Fire      52       43      1
4    Charmeleon     Fire      64       58      2
..          ...      ...     ...      ...    ...
146     Dratini   Dragon      64       45      1
147   Dragonair   Dragon      84       65      2
148   Dragonite   Dragon     134       95      3
149      Mewtwo  Psychic     110       90      1
150         Mew  Psychic     100      100      1

[151 rows x 5 columns]

In [108]:
pk.iloc[0:11, [1,2]]

          Name Type 1
0    Bulbasaur  Grass
1      Ivysaur  Grass
2     Venusaur  Grass
3   Charmander   Fire
4   Charmeleon   Fire
5    Charizard   Fire
6     Squirtle  Water
7    Wartortle  Water
8    Blastoise  Water
9     Caterpie    Bug
10     Metapod    Bug

In [110]:
pk.iloc[[0, 10, 20, 30, 45, 50]]

,Num,Name,Type 1,Type 2,Total,HP,Attack,Defense,SpAtk,SpDef,Speed,Stage,Legendary
0,1,Bulbasaur,Grass,Poison,318,45,49,49,65,65,45,1,False
10,11,Metapod,Bug,NaN,205,50,20,55,25,25,30,2,False
20,21,Spearow,Normal,Flying,262,40,60,30,31,31,70,1,False
30,31,Nidoqueen,Poison,Ground,505,90,92,87,75,85,76,3,False
45,46,Paras,Bug,Grass,285,35,70,55,45,55,25,1,False
50,51,Dugtrio,Ground,NaN,405,35,80,50,50,70,120,2,False

In [113]:
pk = pd.read_csv("downloads\pokemon.csv", encoding="latin1", index_col = "Name")
pk.head()

,Num,Type 1,Type 2,Total,HP,Attack,Defense,SpAtk,SpDef,Speed,Stage,Legendary
Name,,,,,,,,,,,,
Bulbasaur,1,Grass,Poison,318,45,49,49,65,65,45,1,False
Ivysaur,2,Grass,Poison,405,60,62,63,80,80,60,2,False
Venusaur,3,Grass,Poison,525,80,82,83,100,100,80,3,False
Charmander,4,Fire,NaN,309,39,52,43,60,50,65,1,False
Charmeleon,5,Fire,NaN,405,58,64,58,80,65,80,2,False

In [115]:
pk.loc[["Metapod", "Weedle","Mew" ]]

,Num,Type 1,Type 2,Total,HP,Attack,Defense,SpAtk,SpDef,Speed,Stage,Legendary
Name,,,,,,,,,,,,
Metapod,11,Bug,NaN,205,50,20,55,25,25,30,2,False
Weedle,13,Bug,Poison,195,40,35,30,20,20,50,1,False
Mew,151,Psychic,NaN,600,100,100,100,100,100,100,1,False

#### Exporting

* Export the pokemon dataset "pk" to a csv file. Check the class folder, did the file show up?

In [116]:
pk.loc[["Charmander", "Charmeleon", "Charizard"], ["Type 1", "Attack", "Defense", "Stage"]]

           Type 1  Attack  Defense  Stage
Name
Charmander   Fire      52       43      1
Charmeleon   Fire      64       58      2
Charizard    Fire      84       78      3

## { Module 6 Homework }

1. Import the pandas library

In [2]:
import pandas as pd

2. Import the axisdata.csv file (saved to Canvas) and store the dataset in a variable named: sales. This dataset includes information about a sales team for a local company. The dataset includes the following columns:

        Fname: first name of the sales person
        Lname: last name of the sales person
        Gender: gender of the sales person
        Hours Worked: hours worked in the last week
        SalesTraining: if sales person ever received sales training
        Years Experience: total years of sales experience
        Cars Sold: number of cars sold in the last week

In [4]:
axis = pd.read_csv("axisdata.csv")
axis

,Fname,Lname,Gender,Hours Worked,SalesTraining,Years Experience,Cars Sold
0,Jada,Walters,F,39,N,3,2
1,Nicole,Henderson,F,46,N,3,6
2,Tanya,Moore,F,42,Y,4,6
3,Ronelle,Jackson,F,38,Y,5,3
4,Brad,Sears,M,33,N,4,2
...,...,...,...,...,...,...,...
994,Victor,Kane,M,22,Y,5,4
995,Charles,Turner,M,45,N,1,4
996,August,Franklin,F,34,Y,4,3
997,Victoria,Rogers,F,29,N,5,1
998,Mike,Gerardo,M,20,N,3,3

3. Inspect the first 10 rows of the dataset "sales". What is the full name of the very first sales person?

In [5]:
axis.head()

,Fname,Lname,Gender,Hours Worked,SalesTraining,Years Experience,Cars Sold
0,Jada,Walters,F,39,N,3,2
1,Nicole,Henderson,F,46,N,3,6
2,Tanya,Moore,F,42,Y,4,6
3,Ronelle,Jackson,F,38,Y,5,3
4,Brad,Sears,M,33,N,4,2

4. Inspect the last 5 rows of the dataset sales. How many rows are there in total in our dataset?

In [6]:
axis.tail()

,Fname,Lname,Gender,Hours Worked,SalesTraining,Years Experience,Cars Sold
994,Victor,Kane,M,22,Y,5,4
995,Charles,Turner,M,45,N,1,4
996,August,Franklin,F,34,Y,4,3
997,Victoria,Rogers,F,29,N,5,1
998,Mike,Gerardo,M,20,N,3,3

5. Write the code to find the information about the dataset. How many columns are there total? In which column(s) do we have missing/NaN values?

In [7]:
axis.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 999 entries, 0 to 998
Data columns (total 7 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Fname             999 non-null    object
 1   Lname             999 non-null    object
 2   Gender            999 non-null    object
 3   Hours Worked      999 non-null    int64
 4   SalesTraining     999 non-null    object
 5   Years Experience  999 non-null    int64
 6   Cars Sold         999 non-null    int64
dtypes: int64(3), object(4)
memory usage: 54.8+ KB

6. Write the code to get summary statistics for our dataset. What is the maximum value in column Hours Worked? What is the minimum value in column Years Experience? What is the average value in column Cars Sold?

In [16]:
axis["Hours Worked"].describe()

count    999.000000
mean      33.727728
std        8.223454
min       20.000000
25%       27.000000
50%       34.000000
75%       41.000000
max       48.000000
Name: Hours Worked, dtype: float64

7. Using the sales dataset, select/display only the Lname column without using iloc or loc. What is the last name of the second sales person?

In [18]:
axis["Lname"]

0       Walters
1      Henderson
2          Moore
3        Jackson
4          Sears
         ...
994         Kane
995       Turner
996     Franklin
997       Rogers
998      Gerardo
Name: Lname, Length: 999, dtype: object

8. Look at the sales dataset at index position 100 with the iloc operation. How many hours has this sales person worked in the past week?

In [19]:
axis.iloc[100]

Fname                 Frank
Lname               Johnson
Gender                    M
Hours Worked             23
SalesTraining             N
Years Experience          5
Cars Sold                 1
Name: 100, dtype: object

9. Look at the sales dataset at index position 35 with the iloc operation. Only select for the column "Cars Sold". How many cars did this sales person sell in the past week?

In [24]:
axis.iloc[35, 6]

4

10. Select the last 7 rows and the columns: fname, gender, and years experience with the iloc operation. How many women are there in this subset? How many years of experience does the last sales person have?

In [25]:
axis.iloc[990:998, [3,4,5]]

     Hours Worked SalesTraining  Years Experience
990            29             N                 5
991            25             Y                 3
992            42             Y                 4
993            35             Y                 2
994            22             Y                 5
995            45             N                 1
996            34             Y                 4
997            29             N                 5

11. Write the code below to re-import the axisdata.csv file as "sales". This time, change the index from the default to the column "Lname".

In [31]:
sales = pd.read_csv("axisdata.csv", index_col = "Lname")

12. Write the code to examine the first 5 rows of the sales dataset. Is the index the column that you wanted?

In [32]:
sales.head()

,Fname,Gender,Hours Worked,SalesTraining,Years Experience,Cars Sold
Lname,,,,,,
Walters,Jada,F,39,N,3,2
Henderson,Nicole,F,46,N,3,6
Moore,Tanya,F,42,Y,4,6
Jackson,Ronelle,F,38,Y,5,3
Sears,Brad,M,33,N,4,2

13. Select the row with the index label "Monroe" using the loc operation. How many sales people have not completed sales training?

In [33]:
sales.loc["Monroe"]

,Fname,Gender,Hours Worked,SalesTraining,Years Experience,Cars Sold
Lname,,,,,,
Monroe,Mike,M,24,Y,4,4
Monroe,Victoria,F,29,Y,4,3
Monroe,Samantha,F,40,Y,4,3
Monroe,Adam,M,30,Y,2,2
Monroe,Betty,F,27,Y,4,3
Monroe,Sam,M,34,N,2,3
Monroe,Victoria,F,31,N,3,4
Monroe,Victoria,F,24,Y,3,4
Monroe,Sam,M,36,Y,5,7
Monroe,Tanya,F,25,Y,4,2
Monroe,Samantha,F,29,Y,3,5
Monroe,Veronica,F,29,Y,1,3
Monroe,Charles,M,34,N,4,3
Monroe,Francine,F,20,N,1,5
Monroe,Francine,F,43,Y,1,5
Monroe,Adam,M,30,Y,4,6
Monroe,Adam,M,27,Y,5,3
Monroe,Martin,M,28,N,5,6
Monroe,Sam,M,44,N,1,5
Monroe,Adam,M,42,Y,2,3
Monroe,Sam,M,32,Y,4,3
Monroe,Karen,F,20,N,2,2
Monroe,Larry,M,32,N,2,5

14. Select the row with the index label "Sears" and the columns "Gender" and "Hours Worked", using the loc operation. How many hours did the first two sales people work?

In [34]:
sales.loc["Monroe", ["Gender", "Hours Worked"]]

       Gender  Hours Worked
Lname
Monroe      M            24
Monroe      F            29
Monroe      F            40
Monroe      M            30
Monroe      F            27
Monroe      M            34
Monroe      F            31
Monroe      F            24
Monroe      M            36
Monroe      F            25
Monroe      F            29
Monroe      F            29
Monroe      M            34
Monroe      F            20
Monroe      F            43
Monroe      M            30
Monroe      M            27
Monroe      M            28
Monroe      M            44
Monroe      M            42
Monroe      M            32
Monroe      F            20
Monroe      M            32

15. Select the columns "Fname" and "Years Experience" for all rows using the loc operation.

In [36]:
sales.loc[:, ["Fname", "Years Experience"]]

              Fname  Years Experience
Lname
Walters        Jada                 3
Henderson    Nicole                 3
Moore         Tanya                 4
Jackson     Ronelle                 5
Sears          Brad                 4
...             ...               ...
Kane         Victor                 5
Turner      Charles                 1
Franklin     August                 4
Rogers     Victoria                 5
Gerardo        Mike                 3

[999 rows x 2 columns]

16. Export your "sales" dataset to a .csv file called "Module 6 HW".

In [38]:
sales.to_csv("WalterSalesExercise.csv")